# St7SetPLTarget

Sets the type of entities created by the points and lines tools.

long St7SetPLTarget(long uID, long Target, long PropNum)

Input Parameters

uID

Strand7 model file ID.

Target

One of plNode, plBeam2, or plBeam3.

PropNum

Property number of created beams.